import { defineStore } from 'pinia';

export const useRegionsStore = defineStore('region', {
    state: () => ({
        provinces: [
            "서울특별시", "부산광역시", "대구광역시", "인천광역시", "광주광역시", "대전광역시",
            "울산광역시", "세종특별자치시", "경기도", "강원도", "충청북도", "충청남도",
            "전라북도", "전라남도", "경상북도", "경상남도", "제주특별자치도"
        ],
        allCities: {
            "서울특별시": ["서울시"],
            "부산광역시": ["부산시"],
            "대구광역시": ["대구시"],
            "인천광역시": ["인천시"],
            "광주광역시": ["광주시"],
            "대전광역시": ["대전시"],
            "울산광역시": ["울산시"],
            "세종특별자치시": ["세종시"],
            "경기도": ["수원시", "성남시", "고양시", "용인시", "안양시", "평택시"],
            "강원도": ["춘천시", "원주시", "강릉시", "동해시"],
            "충청북도": ["청주시", "충주시", "제천시"],
            "충청남도": ["천안시", "공주시", "보령시", "아산시"],
            "전라북도": ["전주시", "익산시", "군산시"],
            "전라남도": ["목포시", "여수시", "순천시"],
            "경상북도": ["포항시", "경주시", "김천시", "구미시"],
            "경상남도": ["창원시", "진주시", "통영시", "사천시"],
            "제주특별자치도": ["제주시", "서귀포시"]
        }
    }),
    getters: {
        getProvinces(state) {
            return state.provinces;
        },
        getCitiesByProvince: (state) => (province) => {
            return state.allCities[province] || [];
        }
    }
});
